[
  {
    "id": "bb165385-9869-4286-8f53-b2b5de054095",
    "name": "Priya E.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "My grad pics came out so perfect!I honestly had no idea that colleges don't customize your graduation stoles for you, and was feeling disappointed that I might not get cool, personalized photos like my friends. Luckily Fashion Greek was able to fit me in!The consultation process was so quick, so easy, and so worth it. I'm beyond grateful."
  },
  {
    "id": "8b3dbf26-698f-4cd7-bfff-f8c99d7b2602",
    "name": "LaToya J.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/cIsVun9UkWDRD4SuUeX8UA/60s.jpg",
    "text": "My husband and I had our business merch printed with our logo here, and we were so pleased with the product! It was a quick turnaround, and everything came out even better than we had expected. The cost was also much less than a previous place we had used- and we received better service. We highly recommend and can't wait to continue doing business with them in the future."
  },
  {
    "id": "00f2ee72-7123-4f44-bed2-698e8ff80eb6",
    "name": "Emily B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/X5I9hU1ORSRKaIH9kq9ezQ/60s.jpg",
    "text": "James was so kind and helped me place my sash order in less than an hour! So happy with the service"
  },
  {
    "id": "e71cdfe1-eb65-4d1b-b89e-2bacc621175a",
    "name": "Sameer A.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/YjQ4gTuLP4Gbev8zFH2nrA/60s.jpg",
    "text": "I had my graduation sash designed and embroidered by Fashion Greek and am really glad that I chose to use them instead of the USC bookstore. In fact, my quote from the USC bookstore was double the price that Fashion Greek quoted me.  James went above and beyond and provided a free consultation meeting in which he planned out exactly what I wanted on my sash, created a mock-up design, and took the time to change the font/layout to make it look better. I later decided that I wanted to add a few extra items to the sash, and the Fashion Greek team sent me a revised mock-up in a very timely fashion and was able to expedite the embroidery process so that the sash would be completed on time. I honestly cannot thank Fashion Greek enough. The sash looks great and I would definitely recommend Fashion Greek to anyone looking for a grad sash. 10/10!"
  },
  {
    "id": "da4e7cf4-4ece-475c-81f9-e773d5a79f34",
    "name": "Joanne B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/p-E61gssDUsSoSU061Xedw/60s.jpg",
    "text": "Most helpful staff.  Very accommodating to what I needed.  Nice owner with a lot of history."
  },
  {
    "id": "d9c40116-d3d7-4270-af0c-3a9caa1dcb0d",
    "name": "Bryan J.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "Tien was really helpful and made light work of a rush job. Fashion Greek USC did their thing!  #USC #BQNupes #Sp2K"
  },
  {
    "id": "75eaccc5-19b6-4107-8597-a16f4e1d4efa",
    "name": "Bisola O.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/0ewo6zcB2Ajep3eCIZPBIw/60s.jpg",
    "text": "A top-notch establishment that has all your graduation sash needs! I went in needing to get my sash custom embroidered ASAP and James was so sweet and helpful! I was able to describe to him my vision and he brought it to life with only several, quick emails! I was so impressed by not only the efficiency of this place but also the quality and care they provide to their customers. BONUS - the grand total was also wayyy cheaper than the USC bookstore and other places in the surrounding area! My piggy bank is happy, I am happy, and could not thank James and the team at Fashion Greek more!"
  },
  {
    "id": "3505489c-66b0-4771-8ac6-6ef8c2c1d7b2",
    "name": "Robert H.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "I came in to get some BGN GEAR for my fraternity. It was kind of last minute. I definitely got a lot of help from Daisy and Kim they were able to set up a design for me. Two of the bro's helped me originally. Everyone here is really nice. It's nice to know that they're still doing great business! My older sister used to come here for her letters too! Definitely the OG WHEN IT COMES TO GREEK THANKS"
  },
  {
    "id": "e16a0f56-995a-4d63-ac9b-85f24864c1a6",
    "name": "Le F.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/Jz7gC2zYLGq5_aZX3TBVAg/60s.jpg",
    "text": "Mark and James are fantastic  I have been regularly getting my designs done on prints stickers and apparel for over a year! Fantastic work, service, and communication. Love this place it will have my business 4L"
  },
  {
    "id": "3473e722-53c2-4308-85f3-22f5cd1ab1ce",
    "name": "Sharon H.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/lavaNSgGyQzEHX7fwLt9lw/60s.jpg",
    "text": "High quality clothing and good customer service. You can literally print whatever you want on anything. Also, you can get a fresh haircut from Hector and some food. And there's always great music playing. Fashion Greek is definitely the #1 place to go if you want customized clothing even if you're not in a frat/sorority. Items that can be printed on include hats, fanny packs, converse, backpacks, socks and more."
  },
  {
    "id": "1c28f135-9597-4489-a43e-f6c640c1083e",
    "name": "Marla B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/A0DV87iwJMCbmMZB6XgfFw/60s.jpg",
    "text": "Fashion Greek is our hero! Thank you, James, for the outstanding customer service. Just days before USC graduation, we needed something embroidered on a custom made sash. Other embroidery shops stopped production and extras, but when we spoke with James, he gave us his personal guarantee it would be done right and on time. We were a bit nervous to leave the sash-anything can happen. He told us by Thursday we would have it. Hours later, yes hours, we received a text that it was done! The stitching is perfect! Thank you for the speedy turnaround and fantastic customer service, Fashion Greek and James!!"
  },
  {
    "id": "d39d8e85-179c-4262-a426-5d0a98d6b00b",
    "name": "Pugslee L.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DkEM5TogjvKyt22vyom8TQ/60s.jpg",
    "text": "I recently needed to get my name embroidered on my graduation sash, only problem was I only had a couple days to do it! Thanks to Fashion Greek USC, I was able to get my sash customized in just 2-5 days and for a very reasonable price! Other places I called were charging double if not more than what I paid here. With that said,  I highly recommend this place for its services and quick turn around time! Thank you!"
  },
  {
    "id": "07527509-10b5-4b85-8795-796cea1e34a7",
    "name": "Christopher N.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "I was looking for some amazing USC Merch, and was assisted by James who was able to help find exactly what I was looking for. He took the time to walk me through the store and was diligent in providing me truly exception customer service. I found my go to place and person to find my USC Gear!Thanks James and staff!"
  },
  {
    "id": "5fc79ebd-737d-416b-a91d-90dc34734eb3",
    "name": "O A.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/PnbvijOdqAAzkCtTHaueZw/60s.jpg",
    "text": "After trying to design my daughter's graduation stole/sash, I sought professional assistance instead. Schedule your zoom or in-person appt via the link found in the COVID-19 section in their Yelp or from their website. The reminders are fantastic. James is the designer for my daughter's graduation stole/sash. His professional expertise and quick editing skills had me at ease and proud of the upcoming result. Tips before your appt:- \"Class of 202- \" and \"USC\" with shield is standard- Bring a list of desired titles, affiliations, honors, college(s), degree(s), logos, seals, quotes, full name of graduate, etc. Easier to delete or edit down, than forgetting a detail.- Talk with your designer on balancing each side on how it looks overall. We placed the USC seal to balance a side. - Turnaround time is 3-4 weeks. There is a rush fee if needed faster."
  },
  {
    "id": "ea6bed26-25b6-413b-b6de-6230016eac24",
    "name": "Maylee W.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DmkARPWWsSj89z45Oe5KbQ/60s.jpg",
    "text": "James was great - I ordered my son's graduation sash over the phone - he sent me a proof immediately and also pictures of the color and fabric samples- I couldn't be more pleased with his service! I highly recommend!"
  },
  {
    "id": "6cfe8e04-160d-4e99-b68f-38bf773ba489",
    "name": "Elite 2023",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/wH7-Tx14h0SVdIprAuThvg/60s.jpg",
    "text": "This is my 5 star review.Been going here for a while.Got some quality embroidery done here and have been Uber happy since.Catwoman bro.Catwoman."
  },
  {
    "id": "23555df0-736b-4c4c-96da-6d1b85fbfb57",
    "name": "Michael P.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/tm7QdkAN6arVpRxXLIc52g/60s.jpg",
    "text": "Fast and friendly service! Reached out to this place to get a custom flag made and was very pleased with the overall experience. I emailed them on a Monday morning to submit my design and get a quote, my flag was ready for pickup by Thursday morning. Only 3 days, so fast! Overall, I'm super happy I came here to get my flag made given the quality of the finished product, professional service, quick turnaround, and price I paid.Parking: Street parking available right outside the store."
  },
  {
    "id": "8f3c40e4-731e-4153-9115-ed2b763ac976",
    "name": "Elite 2023",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/jWpVgL_gEu-ZmPdobsSbQw/60s.jpg",
    "text": "Graduation is approaching and (much like many others on here) I wanted to get a customised sash. This place came highly recommended by one of my friends so I sent them a quotation and they got back to me pretty quickly, including a quick bit of advice. I decided to book an appointment to discuss the customisation of my sash and the designer James was SO helpful and patient with me when I felt a bit indecisive. He will offer his expert opinion if asked but will ultimately defer to the person's decision, and I really appreciated the little nudges I got regarding certain design choices I'd made because the overall design looked even better after his edits. I'd highly recommend Fashion Greek USC for anyone who's looking to customise their sash, and I'm definitely recommending this store to all my friends! I can't wait to get my sash for graduation!(also they have much nicer color options for sashes instead of just the bright red sash from the USC Bookstore which clashes badly with my skin. I really liked the dark satin option that they have!)A big plus is that you won't have to pay the entire amount of your sash upfront; you can pay a 50% deposit and pay the remaining 50% upon collection. This was a wonderful option!"
  },
  {
    "id": "0582665a-ed94-4f1c-90d7-ab91124550bc",
    "name": "Josh B.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "I couldn't recommend Fashion Greek USC more! James helped me to create my graduation sash and I couldn't be happier with it! He went above and beyond to help me, and was extremely accommodating. Thank you for all your help James!"
  },
  {
    "id": "90a7af46-e1f0-479b-86ca-63a345c7345c",
    "name": "Elite 2023",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/mlBYa5Jd5pzSGrbPEst0yQ/60s.jpg",
    "text": "After looking everywhere for a custom sweatshirt, I went to two different places and both stroke out but then I found Fashion Greek USC and decided to give them a try.  The third time was definitely the CHARM because not only did they deliver in the EXACT design I was looking for with a high quality printed sweatshirt but also with super fast shipping and amazing service!!  I would highly recommend them to anyone looking for any type of custom printed items!   They are absolutely the best!"
  },
  {
    "id": "a84c84a1-c240-4eea-bfe1-b7f19d24742a",
    "name": "Clarissa E.",
    "image": null,
    "text": ""
  },
  {
    "id": "c8ea6840-c4f2-41f8-9a4b-255ebf691f7b",
    "name": "Amber M.",
    "image": null,
    "text": ""
  },
  {
    "id": "a6f99296-7236-47b7-8a6b-0cf1345ea7a2",
    "name": "S H.",
    "image": null,
    "text": ""
  },
  {
    "id": "6a5d9f47-03b0-4223-854a-3b33588b9021",
    "name": "Alicia M.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "I was searching for a place near my job to have some custom designs printed on a couple of onesies to match the theme for my son and daughter in law's baby shower. I found this spot across the street. The guy behind the counter, James was very friendly and took care of me within a couple of minutes! I was able to drop off the onesies during my break and pick them up the same day. They did an amazing job! I highly recommend this place"
  },
  {
    "id": "54887fd1-588f-4dc5-b751-fa27d77b233d",
    "name": "Kelly B.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "Another printing shop that I got my sash from messed up one of my embroideries. I received my sash one week away from taking my graduation photos and I was nervous I'd have to remove the messed up embroidery myself. However, when I walked in to Fashion Greek the employees were more than willing to help me with my problem. They were able to rush order my sash to get it fixed on time for my grad photos at the end of the week. What gives this place a 6/5 stars is the fact that they actually ended up getting my sash fixed in two days rather than taking the whole week to finish it. Give this place your business, you won't regret it!"
  },
  {
    "id": "65f58637-490e-4557-9d15-aa49b4dc54a6",
    "name": "Elliot C.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/qDqslz3aSDLHY4h_5ascRw/60s.jpg",
    "text": "Great service by James. Super accommodating, my friends and I showed up at Fashion Greek without an appointment, and he was super patient and responsive when customizing our sashes."
  },
  {
    "id": "a9723aee-ccb2-4eee-b52b-4a3ccaa59959",
    "name": "Sabrina F.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DiEB-385u49qedm27uI2uQ/60s.jpg",
    "text": "Quality embroidery and quick service. I came in with 3 scrub tops to be embroidered and the lady immediately drafted a mock up of what it would look like on her computer right in from of me. It was impressive. It's $15 for 4 inches of space and I got two lines with different colors in each line. They were profession al and efficient. I got a text when they were ready to be picked up. They ask when you need it by and they def will have it by that day. Just a FYI - The shop shares space with Hector the Barber."
  },
  {
    "id": "c3983b58-d61b-4e92-a55f-97b44c026ed1",
    "name": "Angel M.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/U9tyRM2GrCkcZ4H7QWO9yQ/60s.jpg",
    "text": "So so goooood!!! Do yourself a favor and order from them. Initially I was as exploring my options where to purchase a customized shirt. There where many options but they seemed to be limited in many aspects. One company was overcharging me and the shirt was low quality, however I remembered in the past one time I had used fashion Greek and that purchase very spectacular. Boy was I glad I choose them!!! This is my second purchase with them it awesome.Important note: I love how they ask questions of what my order was about and how they executed their communication skills!I love how they sell trusted brand name shirts such as Bella canvas (it's cotton ring spun, a great source of quality in the market- soft feel and look - also durable).Also an employee by the name of Khim did a phenomenal job, I'm very big on communication and she made sure to go over the work with and I absolutely LOVE it and how well she worked with me. She adjusted my logo in the right spacing and aligned it just how I had in mind, she was impeccable and made my experience stress free.Make sure your order and shirt is aligned properly to avoid conflicts including width & height :) They also have a shipping option which I think is super helpful, if you're not in a rush get it shipped. It so cool receiving stuff during quarantine. It's saves you gas and time also it's very affordable shipping!!!!The owner Mark did such a fantastic job, for quality assurance he called me and went above and beyond to make sure my order experience was nothing less than great.In my most honest opinion the team here does a wonderful job!!! I appreciate the fact that Khim wasn't annoyed making adjustments to my order prior to shipping, she was patient and understood how important my order was to me. Especially over the fact that in this order: I was ordering for my cleaning company. I'm so happy with the results! The shirt quality is great, the printing quality is awesome and the customer services was the cherry on top!!! I'm excited to do business in the further here. Thanks everyone once again, I appreciate your hard work!!"
  },
  {
    "id": "3022d00b-a900-4c3f-8349-400fc2f1b4ff",
    "name": "Lola B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/86RN_k593J2KOzAe2U0FzA/60s.jpg",
    "text": "I just spoke to Khem about how wonderful my experience was here. I had a purchased a customized gift to give someone that is very dear to me and Fashion Greek did such a wonderful job completing my request. Honestly it was beyond my expectations how they helped me. I made my purchase and they reviewed the fine details to make sure my purchase was great. I ordered and front and back text: let me tell you it came out super excellent!! My friend has the sweeter I got her with the writing that says \"God is with me\" and she loves it. Thank you fashion Greek usc for helping make my gift special. Because of this I'm going to make another again with them today! Thank you so much everyone and have a great day"
  },
  {
    "id": "025068f4-8256-4c72-88dc-c01a9ca24901",
    "name": "April L.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/JtL7jkceZyX2PSrnwOfLSA/60s.jpg",
    "text": "Great services, I had my sash embroidered. They were very professional and timely; answered all of my emails within a few hours!"
  },
  {
    "id": "39fff354-d72f-4240-9a63-aa2985aded75",
    "name": "Daniella N.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/gckgKRXQvgG0u8od7nawQg/60s.jpg",
    "text": "I heard from my friends that Fashion Greek was a great alternative to the USC Bookstore for grad sashes, and they were 100% right! Setting up an appointment was easy, and so was the design process. Big shoutout to Tien for helping me with everything!!"
  },
  {
    "id": "dcdb498d-74a3-40b4-a48b-03052485df30",
    "name": "Wing C.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/3pPuPedZEuv1Y47AskUCYg/60s.jpg",
    "text": "THIS SASH IS GORGEOUS! They did exactly what I wanted and went over and beyond my expectations. I had a vision and they made it come to life! I recommend all CSUN students to make the drive because it was well worth it. I'm so glad I went to fashion Greek because they really took care of me and made sure I was 100% satisfied. Thank you so much, can't wait to walk the stage in my sash!!!"
  },
  {
    "id": "3f90f658-97b8-4db1-8d25-5820b2ae44b6",
    "name": "Elite 2023",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png",
    "text": "This place rocks! They have awesome customer service and reply to you very quickly. I've done embroidery and DTG here and they've all came out superb. It's a bit out of the way for me, but it's worth the drive. I recommend friends and family to go here to get custom items done. Thank you David and Mark, for making my project from beginning to end as easy as possible!"
  },
  {
    "id": "855e73ab-2cd3-4c31-b9f6-09069795a59b",
    "name": "Liliana O.",
    "image": null,
    "text": "I made a zoom appointment to customize my graduation stole/sash. It was super easy to make an appt via their link and then they sent me the zoom link the day of the appointment. I met with James and he was super friendly. He worked with me on designing my graduation stole using the picture I had emailed them. I also worked with James to create a customized logo and was very pleased. They made it super easy and to top it off right now they have a 10% off promotion if you order by the early bird deadline. I can't wait to get my graduation stole in a few weeks."
  }
]