[
  {
    "id": "bd45b0d1-9611-4f66-8b43-9cc24bf1d46f",
    "name": "LaToya J.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/cIsVun9UkWDRD4SuUeX8UA/60s.jpg",
    "text": "My husband and I had our business merch printed with our logo here, and we were so pleased with the product! It was a quick turnaround, and everything came out even better than we had expected. The cost was also much less than a previous place we had used- and we received better service. We highly recommend and can't wait to continue doing business with them in the future."
  },
  {
    "id": "af0481fb-5ccf-4e6f-a246-8d077f385fe2",
    "name": "Emily B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/X5I9hU1ORSRKaIH9kq9ezQ/60s.jpg",
    "text": "James was so kind and helped me place my sash order in less than an hour! So happy with the service"
  },
  {
    "id": "f6707824-bc1d-4aee-9876-e25939884422",
    "name": "Josh B.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/tm7QdkAN6arVpRxXLIc52g/60s.jpg",
    "text": "Fast and friendly service! Reached out to this place to get a custom flag made and was very pleased with the overall experience. I emailed them on a Monday morning to submit my design and get a quote, my flag was ready for pickup by Thursday morning. Only 3 days, so fast! Overall, I'm super happy I came here to get my flag made given the quality of the finished product, professional service, quick turnaround, and price I paid.Parking: Street parking available right outside the store."
  },
  {
    "id": "18bd058d-6358-4102-9371-a2c8d23be707",
    "name": "Elite 24",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/0ewo6zcB2Ajep3eCIZPBIw/60s.jpg",
    "text": "A top-notch establishment that has all your graduation sash needs! I went in needing to get my sash custom embroidered ASAP and James was so sweet and helpful! I was able to describe to him my vision and he brought it to life with only several, quick emails! I was so impressed by not only the efficiency of this place but also the quality and care they provide to their customers. BONUS - the grand total was also wayyy cheaper than the USC bookstore and other places in the surrounding area! My piggy bank is happy, I am happy, and could not thank James and the team at Fashion Greek more!"
  },
  {
    "id": "70233586-1650-4a52-8b66-c157669cd548",
    "name": "Bisola O.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/wH7-Tx14h0SVdIprAuThvg/60s.jpg",
    "text": "This is my 5 star review.Been going here for a while.Got some quality embroidery done here and have been Uber happy since.Catwoman bro.Catwoman."
  },
  {
    "id": "089e707f-270d-4fd3-ba36-6cc280087dd5",
    "name": "Michael P.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/Jz7gC2zYLGq5_aZX3TBVAg/60s.jpg",
    "text": "Mark and James are fantastic  I have been regularly getting my designs done on prints stickers and apparel for over a year! Fantastic work, service, and communication. Love this place it will have my business 4L"
  },
  {
    "id": "a999d93d-32de-4c91-b9d4-2fec5a47a414",
    "name": "Elite 24",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/p-E61gssDUsSoSU061Xedw/60s.jpg",
    "text": "High quality clothing and good customer service. You can literally print whatever you want on anything. Also, you can get a fresh haircut from Hector and some food. And there's always great music playing. Fashion Greek is definitely the #1 place to go if you want customized clothing even if you're not in a frat/sorority. Items that can be printed on include hats, fanny packs, converse, backpacks, socks and more."
  },
  {
    "id": "ee652659-33ab-43ec-99f8-50014afe4130",
    "name": "Le F.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/PnbvijOdqAAzkCtTHaueZw/60s.jpg",
    "text": "Most helpful staff.  Very accommodating to what I needed.  Nice owner with a lot of history."
  },
  {
    "id": "f5b983bc-0770-4235-9624-4d76075021ce",
    "name": "Joanne B.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/public/default_user_avatar_64x64_v2.yji-19e0a8ff85b15f4bbd79.png",
    "text": "After trying to design my daughter's graduation stole/sash, I sought professional assistance instead. Schedule your zoom or in-person appt via the link found in the COVID-19 section in their Yelp or from their website. The reminders are fantastic. James is the designer for my daughter's graduation stole/sash. His professional expertise and quick editing skills had me at ease and proud of the upcoming result. Tips before your appt:- \"Class of 202- \" and \"USC\" with shield is standard- Bring a list of desired titles, affiliations, honors, college(s), degree(s), logos, seals, quotes, full name of graduate, etc. Easier to delete or edit down, than forgetting a detail.- Talk with your designer on balancing each side on how it looks overall. We placed the USC seal to balance a side. - Turnaround time is 3-4 weeks. There is a rush fee if needed faster."
  },
  {
    "id": "66c9f76f-1eb8-4e6b-a410-43735f11ef12",
    "name": "Odette A.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DmkARPWWsSj89z45Oe5KbQ/60s.jpg",
    "text": "Tien was really helpful and made light work of a rush job. Fashion Greek USC did their thing!  #USC #BQNupes #Sp2K"
  },
  {
    "id": "55cd1b31-9c0f-4d8e-8b6f-c6694f414037",
    "name": "Bryan J.",
    "image": null,
    "text": "James was great - I ordered my son's graduation sash over the phone - he sent me a proof immediately and also pictures of the color and fabric samples- I couldn't be more pleased with his service! I highly recommend!"
  },
  {
    "id": "07a808ed-effd-4393-8b99-6eadb1669a27",
    "name": "Maylee W.",
    "image": null,
    "text": ""
  },
  {
    "id": "12f14ee1-5da2-4fb2-8270-6d8698f8c053",
    "name": "Elite 24",
    "image": null,
    "text": ""
  },
  {
    "id": "fbb86fc3-e5de-413e-90d5-9a1ba35f8d85",
    "name": "Tori H.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/93Y-ZnEOI_uPxsb-Xoy-wg/60s.jpg",
    "text": "Great services, I had my sash embroidered. They were very professional and timely; answered all of my emails within a few hours!"
  },
  {
    "id": "e36e995f-3f1e-4eb4-b8c7-dfad75ccfe3a",
    "name": "Elite 24",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/lavaNSgGyQzEHX7fwLt9lw/60s.jpg",
    "text": "5/5 service! Just make sure to make an appointment as it gets busier. I went in for a scheduled appointment and James helped me out with designing my sash. He spent the time to swap out different fonts/layouts and the design ended up looking better than what I had in mind. Super friendly, helpful, and efficient. I would highly recommend for anyone looking for someone to help them out with their grad sashes!"
  },
  {
    "id": "2ed6a4ea-0fd9-48a9-badb-607477feab16",
    "name": "Sharon H.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/jWpVgL_gEu-ZmPdobsSbQw/60s.jpg",
    "text": "Graduation is approaching and (much like many others on here) I wanted to get a customised sash. This place came highly recommended by one of my friends so I sent them a quotation and they got back to me pretty quickly, including a quick bit of advice. I decided to book an appointment to discuss the customisation of my sash and the designer James was SO helpful and patient with me when I felt a bit indecisive. He will offer his expert opinion if asked but will ultimately defer to the person's decision, and I really appreciated the little nudges I got regarding certain design choices I'd made because the overall design looked even better after his edits. I'd highly recommend Fashion Greek USC for anyone who's looking to customise their sash, and I'm definitely recommending this store to all my friends! I can't wait to get my sash for graduation!(also they have much nicer color options for sashes instead of just the bright red sash from the USC Bookstore which clashes badly with my skin. I really liked the dark satin option that they have!)A big plus is that you won't have to pay the entire amount of your sash upfront; you can pay a 50% deposit and pay the remaining 50% upon collection. This was a wonderful option!"
  },
  {
    "id": "054927de-7dee-4b11-a431-6d83c754faf7",
    "name": "Clarissa E.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/public/default_user_avatar_64x64_v2.yji-19e0a8ff85b15f4bbd79.png",
    "text": "I came in to get some BGN GEAR for my fraternity. It was kind of last minute. I definitely got a lot of help from Daisy and Kim they were able to set up a design for me. Two of the bro's helped me originally. Everyone here is really nice. It's nice to know that they're still doing great business! My older sister used to come here for her letters too! Definitely the OG WHEN IT COMES TO GREEK THANKS"
  },
  {
    "id": "64973fb1-0298-406a-9474-ae4065f6b7fc",
    "name": "Robert H.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/A0DV87iwJMCbmMZB6XgfFw/60s.jpg",
    "text": "Fashion Greek is our hero! Thank you, James, for the outstanding customer service. Just days before USC graduation, we needed something embroidered on a custom made sash. Other embroidery shops stopped production and extras, but when we spoke with James, he gave us his personal guarantee it would be done right and on time. We were a bit nervous to leave the sash-anything can happen. He told us by Thursday we would have it. Hours later, yes hours, we received a text that it was done! The stitching is perfect! Thank you for the speedy turnaround and fantastic customer service, Fashion Greek and James!!"
  },
  {
    "id": "1d32ab1c-ad1f-4792-a93e-12c25dc34b3f",
    "name": "Marla S.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DkEM5TogjvKyt22vyom8TQ/60s.jpg",
    "text": "I recently needed to get my name embroidered on my graduation sash, only problem was I only had a couple days to do it! Thanks to Fashion Greek USC, I was able to get my sash customized in just 2-5 days and for a very reasonable price! Other places I called were charging double if not more than what I paid here. With that said,  I highly recommend this place for its services and quick turn around time! Thank you!"
  },
  {
    "id": "90ab0fd6-ba6e-4ca3-a21e-52fd33ff0ce6",
    "name": "Pugslee L.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/DiEB-385u49qedm27uI2uQ/60s.jpg",
    "text": "Quality embroidery and quick service. I came in with 3 scrub tops to be embroidered and the lady immediately drafted a mock up of what it would look like on her computer right in from of me. It was impressive. It's $15 for 4 inches of space and I got two lines with different colors in each line. They were profession al and efficient. I got a text when they were ready to be picked up. They ask when you need it by and they def will have it by that day. Just a FYI - The shop shares space with Hector the Barber."
  },
  {
    "id": "f074644b-bd25-44bd-b052-008598aaaa5e",
    "name": "Sabrina F.",
    "image": "https://s3-media0.fl.yelpcdn.com/assets/public/default_user_avatar_64x64_v2.yji-19e0a8ff85b15f4bbd79.png",
    "text": "I was looking for some amazing USC Merch, and was assisted by James who was able to help find exactly what I was looking for. He took the time to walk me through the store and was diligent in providing me truly exception customer service. I found my go to place and person to find my USC Gear!Thanks James and staff!"
  },
  {
    "id": "42d0adc9-a9fa-441d-b01a-d707e144d0d5",
    "name": "Christopher N.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/mlBYa5Jd5pzSGrbPEst0yQ/60s.jpg",
    "text": "After looking everywhere for a custom sweatshirt, I went to two different places and both stroke out but then I found Fashion Greek USC and decided to give them a try.  The third time was definitely the CHARM because not only did they deliver in the EXACT design I was looking for with a high quality printed sweatshirt but also with super fast shipping and amazing service!!  I would highly recommend them to anyone looking for any type of custom printed items!   They are absolutely the best!"
  },
  {
    "id": "9f8d76a1-0a3a-4b80-b952-7c40f30c109a",
    "name": "S H.",
    "image": "https://s3-media0.fl.yelpcdn.com/photo/3pPuPedZEuv1Y47AskUCYg/60s.jpg",
    "text": "This place rocks! They have awesome customer service and reply to you very quickly. I've done embroidery and DTG here and they've all came out superb. It's a bit out of the way for me, but it's worth the drive. I recommend friends and family to go here to get custom items done. Thank you David and Mark, for making my project from beginning to end as easy as possible!"
  },
  {
    "id": "0f4131e4-d915-40e4-a7e5-8187ccc82623",
    "name": "Wing C.",
    "image": null,
    "text": ""
  },
  {
    "id": "51537eca-34c3-421b-85b9-b2186110525b",
    "name": "Elite 24",
    "image": null,
    "text": ""
  }
]